files/.emacs.d/config.el
(defvar elpaca-installer-version 0.10)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install a package via the elpaca macro
;; See the "recipes" section of the manual for more details.

;; (elpaca example-package)


;; Install use-package support
(elpaca elpaca-use-package
  ;; Enable use-package :ensure support for Elpaca.
  (elpaca-use-package-mode))


(setq use-package-always-ensure t)

;;When installing a package used in the init file itself,
;;e.g. a package which adds a use-package key word,
;;use the :wait recipe keyword to block until that package is installed/configured.
;;For example:
;;(use-package general :ensure (:wait t) :demand t)

;; Expands to: (elpaca evil (use-package evil :demand t))
(use-package evil
:ensure t
:init
(setq evil-want-integration t
      evil-want-keybinding nil)
:config
(evil-mode 1))  ;; Enable Evil mode at startup



;;Turns off elpaca-use-package-mode current declaration
;;Note this will cause evaluate the declaration immediately. It is not deferred.
;;Useful for configuring built-in emacs features.
(use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))

;; Install general.el
    (elpaca general)

    ;; Wait for general to be installed
    (elpaca-wait)

    ;; Now configure general after it's properly installed
    (require 'general)

    ;; Create a leader key definer that only applies in normal and visual modes, not insert mode
    (general-create-definer my-leader-def
      :states '(normal visual)  ;; Only apply in normal and visual states, not insert
      :prefix "SPC")

    ;; Define keybindings using the definer
    (my-leader-def
      ;; SPC + . to find file
      "." '(find-file :which-key "find file")

      
      ;; SPC + . to find file
      "bs" '(switch-to-buffer :which-key "Switch to buffer")
      
      ;; SPC + q q Kill Emacs
      "qq" '(kill-emacs :which-key "quit emacs")

      ;; SPC + c d change default DIR
      "cd" '(cd :which-key "change default directory")
      
      ;; SPC + f s to save file
      "fs" '(save-buffer :which-key "save file"))


  ;; Unbind M-e so it can be used as a prefix
  (global-unset-key (kbd "M-e"))

  ;; Define tab-related keybindings
  ;;(general-create-definer my-leader-def-tab
  ;;  :prefix "M-e")

  ;;(my-leader-def-tab
  ;;  "t" '(tab-new :which-key "new tab")
  ;;  "q" '(tab-close :which-key "close tab")
  ;;  "w" '(tab-next :which-key "next tab"))

;; Unbind C-= and C-- so they can be used for zooming
(global-unset-key (kbd "C-="))
(global-unset-key (kbd "C--"))

 

    ;; For non-Evil users, create an alternative global map with C-c as prefix
    ;; This is optional but provides a fallback if you're not always in Evil mode
    (general-create-definer my-leader-def-global
      :prefix "C-c"
      :non-normal-prefix "C-c")

    (my-leader-def-global
      ;; C-c . to find file
      "." '(find-file :which-key "find file")

      ;; C-c q q to kill emacs
      "qq" '(kill-emacs :which-key "quit emacs")
      
      ;; C-c f s to save file
      "fs" '(save-buffer :which-key "save file"))

(use-package nerd-icons
    :ensure t)

  (elpaca-wait)
  ;; Run this ONCE after installing nerd-icons
;; uncomment this line, wait for it to install fonts and them comment this line.
;;  (nerd-icons-install-fonts t)
