files/.emacs.d/config.el

;; First ensure all-the-icons is installed and loaded
(use-package all-the-icons
  :ensure t)

;; Enhanced dashboard configuration with colors and features
(use-package dashboard
  :ensure t
  :after all-the-icons  ;; Make sure all-the-icons is loaded first
  :init
  (use-package page-break-lines :ensure t)
  :custom
  ;; Set the title with fancy formatting
  (dashboard-banner-logo-title
   (propertize "Welcome to Emacs. Vim users just don't get this, do they?"
               'face '(:family "Fira Code" :height 1.2 :weight bold
                      :foreground "#61AFEF")))
  
  ;; Set the banner
  (dashboard-startup-banner "~/.emacs.d/icons/arkmacs-4.png" "~/.emacs.d/icons/arkmacs-4.txt")
  
  ;; Enable icons for a more modern look
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  
  ;; Content is not centered by default
  (dashboard-center-content nil)
  ;; Vertically center content
  (dashboard-vertically-center-content t)
  ;; Hide shortcut indicators
  (dashboard-show-shortcuts nil)
  
  ;; Show project list with fancy icon
  (dashboard-items '((recents  . 5)
                    (bookmarks . 5)
                    (projects . 5)
                    (agenda . 5)))
  
  ;; Customize item names with colors
  (dashboard-item-names '(("Recent Files:" . "Recent Files:")
                          ("Bookmarks:" . "Bookmarks:")
                          ("Projects:" . "Projects:")
                          ("Agenda:" . "Agenda:")))
  
  ;; Custom footer with cool quotes
  (dashboard-footer-messages '("Emacs: Making Vim users question their life choices since 1976"
                              "Where there's a shell, there's a way"
                              "May the source be with you!"))
  :config
  ;; Set up pretty symbols for various elements only if all-the-icons is available
  (when (package-installed-p 'all-the-icons)
    (setq dashboard-footer-icon (all-the-icons-faicon "code" 
                                                     :height 1.1 
                                                     :v-adjust -0.05 
                                                     :face '(:foreground "#98C379")))
    
    ;; Only set navigator buttons if all-the-icons is available
    (setq dashboard-navigator-buttons
         `(((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
            "GitHub" "Browse GitHub" (lambda (&rest _) (browse-url "https://github.com")))
            (,(all-the-icons-fileicon "emacs" :height 1.1 :v-adjust 0.0)
            "Config" "Edit config" (lambda (&rest _) (find-file "~/.emacs.d/init.el")))
            (,(all-the-icons-faicon "refresh" :height 1.1 :v-adjust 0.0)
            "Update" "Update packages" (lambda (&rest _) (package-refresh-contents)))
            (,(all-the-icons-octicon "gear" :height 1.1 :v-adjust 0.0)
            "Settings" "Open settings" (lambda (&rest _) (find-file "~/.emacs.d/settings.org"))))))
    
    (dashboard-modify-heading-icons '((recents . "file-text")
                                     (bookmarks . "bookmark")
                                     (agenda . "calendar")
                                     (projects . "file-directory")
                                     (registers . "database"))))
  
  ;; Custom item face colors
  (custom-set-faces
   '(dashboard-heading ((t (:foreground "#C678DD" :weight bold))))
   '(dashboard-items-face ((t (:foreground "#ABB2BF"))))
   '(dashboard-banner-logo-title-face ((t (:foreground "#56B6C2" :weight bold)))))
  
  ;; Enable the dashboard
  (dashboard-setup-startup-hook))

;; Optional: Make the dashboard more colorful with rainbow mode
(use-package rainbow-mode
  :ensure t
  :hook (dashboard-mode . rainbow-mode))

(use-package vertico
 :ensure t
 :init
 (vertico-mode))

(use-package doom-themes
    :ensure t
:config
(load-theme 'doom-meltbus t))


 ;; Additonal Themes
 (use-package constant-theme)
 (use-package simplicity-theme)

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic partial-completion substring))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles basic partial-completion))
                                   (eglot (styles orderless)))))

(use-package corfu
  :ensure t
  :custom
  (corfu-auto t)                       ;; Enable auto completion
  (corfu-auto-delay 0.0)               ;; No delay for auto completion (more responsive)
  (corfu-auto-prefix 1)                ;; Show completions after typing just 1 character
  (corfu-cycle t)                      ;; Allow cycling through candidates
  (corfu-preselect 'first)             ;; Always preselect first candidate
  (corfu-count 14)                     ;; Show more candidates
  (corfu-max-width 80)                 ;; Set maximum width for popup
  (corfu-preview-current t)            ;; Preview current candidate
  (corfu-on-exact-match nil)           ;; Don't auto-complete exact matches
  (tab-always-indent 'complete)        ;; Use TAB for both indent and completion
  :bind
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous)
        ("RET" . corfu-insert)
        ("M-SPC" . corfu-insert-separator)
        ("C-g" . corfu-quit))
  :init
  (global-corfu-mode)
  :config
  ;; Enable Corfu completion in the minibuffer
  (defun corfu-enable-always-in-minibuffer ()
    "Enable Corfu in the minibuffer regardless of `completion-at-point'."
    (setq-local corfu-auto nil)        ;; Enable manual triggering only
    (corfu-mode 1))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer))

;; Helper function to restart Corfu if needed
(defun restart-corfu ()
  "Restart corfu-mode globally."
  (interactive)
  (global-corfu-mode -1)
  (sleep-for 0.1)
  (global-corfu-mode 1)
  (message "Corfu restarted"))

(use-package cape
  :ensure t
  :init
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-height 28) ;; Adjust height
  (setq doom-modeline-bar-width 4)
  (setq doom-modeline-project-detection 'auto)
  (setq doom-modeline-buffer-file-name-style 'truncate-upto-project))

;; (use-package powerline
;;  :ensure t
;;  :config
;;  (powerline-default-theme))
;;

(use-package vterm
    :ensure t)

;; (use-package org-bullets
;;   :ensure t
;;   :init
;;       (add-hook 'org-mode-hook (lambda ()
;;                            (org-bullets-mode 1))))
