files/.emacs.d/config.org
** Org Modern
Org mode but modern! Nice additions to org mode formatting.

#+begin_src emacs-lisp
   ;; (use-package org-modern
   ;;  :ensure t
   ;;  :hook (org-mode . org-modern-mode))
  (elpaca-wait)
(use-package org-modern
  :ensure t
  :after org
  :init
  (global-org-modern-mode)
  :config
  (setq org-modern-list nil)
  (setq org-modern-star 'fold)
  (setq org-modern-fold-stars '(("◉" . "○") ("◈" . "◇") ("▣" . "□") ("◉" . "○") ("◈" . "◇") ("▣" . "□") ("◉" . "○") ("◈" . "◇") ("▣" . "□")))
  (setq org-modern-block-fringe nil)
  (setq org-modern-progress 18)
  (setq org-modern-table nil)
  (setq org-modern-todo-faces
    '(("TODO" :background "#323c41" :foreground "#83c092" :weight semibold)
      ("NEXT" :background "#323c41" :foreground "#ddbc7f" :weight semibold)
      ("DONE" :background "#323c41" :foreground "#a7c080" :weight semibold)
      ("BACKLOG" :background "#323c41" :foreground "#e67e80" :weight semibold)
      ("PLAN" :background "#323c41" :foreground "#ddbc74" :weight semibold)
      ("READY" :background "#323c41" :foreground "#a7c080" :weight semibold)
      ("ACTIVE" :background "#323c41" :foreground "#7fbbb3" :weight semibold)
      ("REVIEW" :background "#323c41" :foreground "#e69875" :weight semibold)
      ("WAIT" :background "#323c41" :foreground "#abb2bf" :weight semibold)
      ("HOLD" :background "#323c41" :foreground "#abb2bf" :weight semibold)
      ("COMPLETED" :background "#323c41" :foreground "#a7c080" :weight semibold)
      ("CANC" :background "#323c41" :foreground "#e67e80" :weight semibold))))

  #+end_src

** Which Key

#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :config
  (which-key-mode)  ;; Enable which-key globally
  (setq which-key-idle-delay 0.5))  ;; Show suggestions faster

#+end_src

** Embark

#+begin_src emacs-lisp
(use-package embark
  :bind
  (("C-," . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :init
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package embark-consult
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src



* Emacs Settings

** Line Numbers

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)

#+end_src

** Initial Buffer

#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
#+end_src

** Tabs

#+begin_src emacs-lisp
  ;; Enable tab bar mode
  (setq tab-bar-show 1)    ;; Always show tabs
  (setq tab-bar-position 'bottom) ;; Move tabs to the bottom
  (setq tab-bar-new-tab-choice "*dashboard*")
  (tab-bar-mode 1)
#+end_src

** Fonts

#+begin_src emacs-lisp
  ;; Set the default font globally (including size)
  (add-to-list 'default-frame-alist '(font . "Ubuntu Mono-14"))
#+end_src


** Org Mode Settings

#+begin_src emacs-lisp
(dolist (face '((org-level-1 . 2.2)
                (org-level-2 . 1.4)
                (org-level-3 . 1.2)
               (org-level-4 . 1.1)
                (org-level-5 . 1.0)))
  (set-face-attribute (car face) nil :height (cdr face)))

#+end_src

** Emacs Keybindings

#+begin_src emacs-lisp
  ;; Bind C-= to increase text scale
  (global-set-key (kbd "C-=") #'text-scale-increase)
  ;; Bind C-- to decrease text scale
  (global-set-key (kbd "C--") #'text-scale-decrease)

(with-eval-after-load 'evil
  (define-key evil-normal-state-map (kbd "C-t") nil)
  (define-key evil-normal-state-map (kbd "C-q") nil)
  (define-key evil-normal-state-map (kbd "C-r") nil))

;; Now set your global keybindings
(global-set-key (kbd "C-t") #'tab-new)
(global-set-key (kbd "C-q") #'tab-close)
(global-set-key (kbd "C-r") #'tab-next)
       
#+end_src

** Electric Pair Mode

#+begin_src emacs-lisp
(electric-pair-mode 1)
#+end_src

** Emacsclient Dashboard Icons

#+begin_src emacs-lisp
;; Ensure dashboard icons appear in emacsclient
(when (daemonp)
  (add-hook 'server-after-make-frame-hook #'dashboard-refresh-buffer))

#+end_src

** Backups


#+begin_src emacs-lisp
  (setq make-backup-files t)
  (setq backup-directory-alist `(("." . "~/emacs-backups")))
#+end_src
